---
type: ExternallyTaggedNonBRep
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ExternallyTaggedNonBRep

`Autodesk.Revit.DB.ExternallyTaggedNonBRep` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternallyTaggedNonBRep | 2022 | `public ExternallyTaggedNonBRep ( ExternalGeometryId externalId , GeometryObject geometry )` |
| Method | SetUsage | 2024 | `public void SetUsage ( ExternallyTaggedNonBRepUsage usage )` |